# Вычислить число пи c заданной точностью d

d = str(input('Введите число d: '))
d = d.split('.')
k = int(len(d[1]))
print(k)
x = 0
for i in range(1, 1000000):
    x = x+4*((-1)**(i+1))/(2*i-1)
print(f'Число пи с точностью до заданного числа: {round(x, k)}')
