# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

print('Введите последовательность чисел')
string = str(input())
string = list(string)
print(len(set(string)))
